name: "ocr"
backend: "python"

input [
  {
    name: "IMAGE_BYTES"
    data_type: TYPE_BYTES
    dims: [1]
  }
]

output [
  {
    name: "TEXT_OUTPUT"
    data_type: TYPE_STRING
    dims: [1]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

parameters: {
    key: "EXECUTION_ENV_PATH",
    value: { string_value: "/models/ocr/1" }
}
